// NLSC official ListCounty + ListTown1 snapshot, 2026-10-26.
// Source: https://data.gov.tw/dataset/102011 (Government Open Data License 1.0).
// Duplicate district names retain every possible county; callers must not guess.
export const districtCities = {
 "七股區": [
  "臺南市"
 ],
 "七美鄉": [
  "澎湖縣"
 ],
 "七堵區": [
  "基隆市"
 ],
 "九如鄉": [
  "屏東縣"
 ],
 "二水鄉": [
  "彰化縣"
 ],
 "二林鎮": [
  "彰化縣"
 ],
 "二崙鄉": [
  "雲林縣"
 ],
 "八里區": [
  "新北市"
 ],
 "八德區": [
  "桃園市"
 ],
 "三民區": [
  "高雄市"
 ],
 "三地門鄉": [
  "屏東縣"
 ],
 "三芝區": [
  "新北市"
 ],
 "三星鄉": [
  "宜蘭縣"
 ],
 "三重區": [
  "新北市"
 ],
 "三峽區": [
  "新北市"
 ],
 "三義鄉": [
  "苗栗縣"
 ],
 "三灣鄉": [
  "苗栗縣"
 ],
 "下營區": [
  "臺南市"
 ],
 "口湖鄉": [
  "雲林縣"
 ],
 "土城區": [
  "新北市"
 ],
 "土庫鎮": [
  "雲林縣"
 ],
 "士林區": [
  "臺北市"
 ],
 "大內區": [
  "臺南市"
 ],
 "大甲區": [
  "臺中市"
 ],
 "大同區": [
  "臺北市"
 ],
 "大同鄉": [
  "宜蘭縣"
 ],
 "大安區": [
  "臺中市",
  "臺北市"
 ],
 "大村鄉": [
  "彰化縣"
 ],
 "大肚區": [
  "臺中市"
 ],
 "大里區": [
  "臺中市"
 ],
 "大林鎮": [
  "嘉義縣"
 ],
 "大武鄉": [
  "臺東縣"
 ],
 "大社區": [
  "高雄市"
 ],
 "大城鄉": [
  "彰化縣"
 ],
 "大埔鄉": [
  "嘉義縣"
 ],
 "大埤鄉": [
  "雲林縣"
 ],
 "大湖鄉": [
  "苗栗縣"
 ],
 "大雅區": [
  "臺中市"
 ],
 "大園區": [
  "桃園市"
 ],
 "大溪區": [
  "桃園市"
 ],
 "大寮區": [
  "高雄市"
 ],
 "大樹區": [
  "高雄市"
 ],
 "小港區": [
  "高雄市"
 ],
 "山上區": [
  "臺南市"
 ],
 "中山區": [
  "基隆市",
  "臺北市"
 ],
 "中正區": [
  "基隆市",
  "臺北市"
 ],
 "中西區": [
  "臺南市"
 ],
 "中和區": [
  "新北市"
 ],
 "中埔鄉": [
  "嘉義縣"
 ],
 "中區": [
  "臺中市"
 ],
 "中寮鄉": [
  "南投縣"
 ],
 "中壢區": [
  "桃園市"
 ],
 "五股區": [
  "新北市"
 ],
 "五峰鄉": [
  "新竹縣"
 ],
 "五結鄉": [
  "宜蘭縣"
 ],
 "仁武區": [
  "高雄市"
 ],
 "仁愛區": [
  "基隆市"
 ],
 "仁愛鄉": [
  "南投縣"
 ],
 "仁德區": [
  "臺南市"
 ],
 "元長鄉": [
  "雲林縣"
 ],
 "內門區": [
  "高雄市"
 ],
 "內埔鄉": [
  "屏東縣"
 ],
 "內湖區": [
  "臺北市"
 ],
 "公館鄉": [
  "苗栗縣"
 ],
 "六甲區": [
  "臺南市"
 ],
 "六腳鄉": [
  "嘉義縣"
 ],
 "六龜區": [
  "高雄市"
 ],
 "太平區": [
  "臺中市"
 ],
 "太保市": [
  "嘉義縣"
 ],
 "太麻里鄉": [
  "臺東縣"
 ],
 "文山區": [
  "臺北市"
 ],
 "斗六市": [
  "雲林縣"
 ],
 "斗南鎮": [
  "雲林縣"
 ],
 "水上鄉": [
  "嘉義縣"
 ],
 "水里鄉": [
  "南投縣"
 ],
 "水林鄉": [
  "雲林縣"
 ],
 "冬山鄉": [
  "宜蘭縣"
 ],
 "北屯區": [
  "臺中市"
 ],
 "北斗鎮": [
  "彰化縣"
 ],
 "北投區": [
  "臺北市"
 ],
 "北門區": [
  "臺南市"
 ],
 "北竿鄉": [
  "連江縣"
 ],
 "北埔鄉": [
  "新竹縣"
 ],
 "北區": [
  "新竹市",
  "臺中市",
  "臺南市"
 ],
 "北港鎮": [
  "雲林縣"
 ],
 "古坑鄉": [
  "雲林縣"
 ],
 "四湖鄉": [
  "雲林縣"
 ],
 "外埔區": [
  "臺中市"
 ],
 "左營區": [
  "高雄市"
 ],
 "左鎮區": [
  "臺南市"
 ],
 "布袋鎮": [
  "嘉義縣"
 ],
 "平溪區": [
  "新北市"
 ],
 "平鎮區": [
  "桃園市"
 ],
 "民雄鄉": [
  "嘉義縣"
 ],
 "永安區": [
  "高雄市"
 ],
 "永和區": [
  "新北市"
 ],
 "永康區": [
  "臺南市"
 ],
 "永靖鄉": [
  "彰化縣"
 ],
 "玉井區": [
  "臺南市"
 ],
 "玉里鎮": [
  "花蓮縣"
 ],
 "田中鎮": [
  "彰化縣"
 ],
 "田尾鄉": [
  "彰化縣"
 ],
 "田寮區": [
  "高雄市"
 ],
 "甲仙區": [
  "高雄市"
 ],
 "白沙鄉": [
  "澎湖縣"
 ],
 "白河區": [
  "臺南市"
 ],
 "石岡區": [
  "臺中市"
 ],
 "石門區": [
  "新北市"
 ],
 "石碇區": [
  "新北市"
 ],
 "光復鄉": [
  "花蓮縣"
 ],
 "吉安鄉": [
  "花蓮縣"
 ],
 "名間鄉": [
  "南投縣"
 ],
 "后里區": [
  "臺中市"
 ],
 "安平區": [
  "臺南市"
 ],
 "安定區": [
  "臺南市"
 ],
 "安南區": [
  "臺南市"
 ],
 "安樂區": [
  "基隆市"
 ],
 "尖石鄉": [
  "新竹縣"
 ],
 "成功鎮": [
  "臺東縣"
 ],
 "朴子市": [
  "嘉義縣"
 ],
 "汐止區": [
  "新北市"
 ],
 "池上鄉": [
  "臺東縣"
 ],
 "竹山鎮": [
  "南投縣"
 ],
 "竹北市": [
  "新竹縣"
 ],
 "竹田鄉": [
  "屏東縣"
 ],
 "竹東鎮": [
  "新竹縣"
 ],
 "竹南鎮": [
  "苗栗縣"
 ],
 "竹崎鄉": [
  "嘉義縣"
 ],
 "竹塘鄉": [
  "彰化縣"
 ],
 "西屯區": [
  "臺中市"
 ],
 "西區": [
  "嘉義市",
  "臺中市"
 ],
 "西港區": [
  "臺南市"
 ],
 "西湖鄉": [
  "苗栗縣"
 ],
 "西嶼鄉": [
  "澎湖縣"
 ],
 "西螺鎮": [
  "雲林縣"
 ],
 "伸港鄉": [
  "彰化縣"
 ],
 "壯圍鄉": [
  "宜蘭縣"
 ],
 "杉林區": [
  "高雄市"
 ],
 "沙鹿區": [
  "臺中市"
 ],
 "牡丹鄉": [
  "屏東縣"
 ],
 "秀水鄉": [
  "彰化縣"
 ],
 "秀林鄉": [
  "花蓮縣"
 ],
 "芎林鄉": [
  "新竹縣"
 ],
 "車城鄉": [
  "屏東縣"
 ],
 "那瑪夏區": [
  "高雄市"
 ],
 "里港鄉": [
  "屏東縣"
 ],
 "佳冬鄉": [
  "屏東縣"
 ],
 "佳里區": [
  "臺南市"
 ],
 "來義鄉": [
  "屏東縣"
 ],
 "卑南鄉": [
  "臺東縣"
 ],
 "卓溪鄉": [
  "花蓮縣"
 ],
 "卓蘭鎮": [
  "苗栗縣"
 ],
 "和平區": [
  "臺中市"
 ],
 "和美鎮": [
  "彰化縣"
 ],
 "坪林區": [
  "新北市"
 ],
 "官田區": [
  "臺南市"
 ],
 "宜蘭市": [
  "宜蘭縣"
 ],
 "岡山區": [
  "高雄市"
 ],
 "延平鄉": [
  "臺東縣"
 ],
 "東山區": [
  "臺南市"
 ],
 "東引鄉": [
  "連江縣"
 ],
 "東石鄉": [
  "嘉義縣"
 ],
 "東河鄉": [
  "臺東縣"
 ],
 "東區": [
  "新竹市",
  "嘉義市",
  "臺中市",
  "臺南市"
 ],
 "東港鎮": [
  "屏東縣"
 ],
 "東勢區": [
  "臺中市"
 ],
 "東勢鄉": [
  "雲林縣"
 ],
 "松山區": [
  "臺北市"
 ],
 "板橋區": [
  "新北市"
 ],
 "枋山鄉": [
  "屏東縣"
 ],
 "枋寮鄉": [
  "屏東縣"
 ],
 "林口區": [
  "新北市"
 ],
 "林內鄉": [
  "雲林縣"
 ],
 "林園區": [
  "高雄市"
 ],
 "林邊鄉": [
  "屏東縣"
 ],
 "社頭鄉": [
  "彰化縣"
 ],
 "芬園鄉": [
  "彰化縣"
 ],
 "花蓮市": [
  "花蓮縣"
 ],
 "花壇鄉": [
  "彰化縣"
 ],
 "芳苑鄉": [
  "彰化縣"
 ],
 "虎尾鎮": [
  "雲林縣"
 ],
 "金山區": [
  "新北市"
 ],
 "金沙鎮": [
  "金門縣"
 ],
 "金城鎮": [
  "金門縣"
 ],
 "金峰鄉": [
  "臺東縣"
 ],
 "金湖鎮": [
  "金門縣"
 ],
 "金寧鄉": [
  "金門縣"
 ],
 "長治鄉": [
  "屏東縣"
 ],
 "長濱鄉": [
  "臺東縣"
 ],
 "阿里山鄉": [
  "嘉義縣"
 ],
 "阿蓮區": [
  "高雄市"
 ],
 "信義區": [
  "基隆市",
  "臺北市"
 ],
 "信義鄉": [
  "南投縣"
 ],
 "前金區": [
  "高雄市"
 ],
 "前鎮區": [
  "高雄市"
 ],
 "南化區": [
  "臺南市"
 ],
 "南屯區": [
  "臺中市"
 ],
 "南州鄉": [
  "屏東縣"
 ],
 "南庄鄉": [
  "苗栗縣"
 ],
 "南投市": [
  "南投縣"
 ],
 "南竿鄉": [
  "連江縣"
 ],
 "南區": [
  "臺中市",
  "臺南市"
 ],
 "南港區": [
  "臺北市"
 ],
 "南澳鄉": [
  "宜蘭縣"
 ],
 "屏東市": [
  "屏東縣"
 ],
 "後壁區": [
  "臺南市"
 ],
 "後龍鎮": [
  "苗栗縣"
 ],
 "恆春鎮": [
  "屏東縣"
 ],
 "春日鄉": [
  "屏東縣"
 ],
 "柳營區": [
  "臺南市"
 ],
 "美濃區": [
  "高雄市"
 ],
 "苑裡鎮": [
  "苗栗縣"
 ],
 "苓雅區": [
  "高雄市"
 ],
 "苗栗市": [
  "苗栗縣"
 ],
 "茂林區": [
  "高雄市"
 ],
 "茄萣區": [
  "高雄市"
 ],
 "香山區": [
  "新竹市"
 ],
 "員山鄉": [
  "宜蘭縣"
 ],
 "員林市": [
  "彰化縣"
 ],
 "埔心鄉": [
  "彰化縣"
 ],
 "埔里鎮": [
  "南投縣"
 ],
 "埔鹽鄉": [
  "彰化縣"
 ],
 "峨眉鄉": [
  "新竹縣"
 ],
 "崁頂鄉": [
  "屏東縣"
 ],
 "桃園區": [
  "桃園市"
 ],
 "桃源區": [
  "高雄市"
 ],
 "泰山區": [
  "新北市"
 ],
 "泰安鄉": [
  "苗栗縣"
 ],
 "泰武鄉": [
  "屏東縣"
 ],
 "海端鄉": [
  "臺東縣"
 ],
 "烈嶼鄉": [
  "金門縣"
 ],
 "烏日區": [
  "臺中市"
 ],
 "烏來區": [
  "新北市"
 ],
 "烏坵鄉": [
  "金門縣"
 ],
 "琉球鄉": [
  "屏東縣"
 ],
 "神岡區": [
  "臺中市"
 ],
 "草屯鎮": [
  "南投縣"
 ],
 "貢寮區": [
  "新北市"
 ],
 "馬公市": [
  "澎湖縣"
 ],
 "高樹鄉": [
  "屏東縣"
 ],
 "國姓鄉": [
  "南投縣"
 ],
 "埤頭鄉": [
  "彰化縣"
 ],
 "將軍區": [
  "臺南市"
 ],
 "崙背鄉": [
  "雲林縣"
 ],
 "望安鄉": [
  "澎湖縣"
 ],
 "梅山鄉": [
  "嘉義縣"
 ],
 "梓官區": [
  "高雄市"
 ],
 "梧棲區": [
  "臺中市"
 ],
 "淡水區": [
  "新北市"
 ],
 "深坑區": [
  "新北市"
 ],
 "清水區": [
  "臺中市"
 ],
 "莒光鄉": [
  "連江縣"
 ],
 "通霄鎮": [
  "苗栗縣"
 ],
 "造橋鄉": [
  "苗栗縣"
 ],
 "魚池鄉": [
  "南投縣"
 ],
 "鳥松區": [
  "高雄市"
 ],
 "鹿谷鄉": [
  "南投縣"
 ],
 "鹿草鄉": [
  "嘉義縣"
 ],
 "鹿野鄉": [
  "臺東縣"
 ],
 "鹿港鎮": [
  "彰化縣"
 ],
 "麥寮鄉": [
  "雲林縣"
 ],
 "麻豆區": [
  "臺南市"
 ],
 "善化區": [
  "臺南市"
 ],
 "富里鄉": [
  "花蓮縣"
 ],
 "復興區": [
  "桃園市"
 ],
 "湖口鄉": [
  "新竹縣"
 ],
 "湖內區": [
  "高雄市"
 ],
 "湖西鄉": [
  "澎湖縣"
 ],
 "番路鄉": [
  "嘉義縣"
 ],
 "莿桐鄉": [
  "雲林縣"
 ],
 "集集鎮": [
  "南投縣"
 ],
 "新化區": [
  "臺南市"
 ],
 "新市區": [
  "臺南市"
 ],
 "新店區": [
  "新北市"
 ],
 "新社區": [
  "臺中市"
 ],
 "新城鄉": [
  "花蓮縣"
 ],
 "新屋區": [
  "桃園市"
 ],
 "新埔鎮": [
  "新竹縣"
 ],
 "新埤鄉": [
  "屏東縣"
 ],
 "新莊區": [
  "新北市"
 ],
 "新港鄉": [
  "嘉義縣"
 ],
 "新園鄉": [
  "屏東縣"
 ],
 "新興區": [
  "高雄市"
 ],
 "新營區": [
  "臺南市"
 ],
 "新豐鄉": [
  "新竹縣"
 ],
 "暖暖區": [
  "基隆市"
 ],
 "楊梅區": [
  "桃園市"
 ],
 "楠西區": [
  "臺南市"
 ],
 "楠梓區": [
  "高雄市"
 ],
 "溪口鄉": [
  "嘉義縣"
 ],
 "溪州鄉": [
  "彰化縣"
 ],
 "溪湖鎮": [
  "彰化縣"
 ],
 "獅子鄉": [
  "屏東縣"
 ],
 "獅潭鄉": [
  "苗栗縣"
 ],
 "瑞芳區": [
  "新北市"
 ],
 "瑞穗鄉": [
  "花蓮縣"
 ],
 "萬丹鄉": [
  "屏東縣"
 ],
 "萬里區": [
  "新北市"
 ],
 "萬華區": [
  "臺北市"
 ],
 "萬榮鄉": [
  "花蓮縣"
 ],
 "萬巒鄉": [
  "屏東縣"
 ],
 "義竹鄉": [
  "嘉義縣"
 ],
 "路竹區": [
  "高雄市"
 ],
 "達仁鄉": [
  "臺東縣"
 ],
 "鼓山區": [
  "高雄市"
 ],
 "壽豐鄉": [
  "花蓮縣"
 ],
 "彰化市": [
  "彰化縣"
 ],
 "旗山區": [
  "高雄市"
 ],
 "旗津區": [
  "高雄市"
 ],
 "滿州鄉": [
  "屏東縣"
 ],
 "瑪家鄉": [
  "屏東縣"
 ],
 "福興鄉": [
  "彰化縣"
 ],
 "綠島鄉": [
  "臺東縣"
 ],
 "臺西鄉": [
  "雲林縣"
 ],
 "臺東市": [
  "臺東縣"
 ],
 "銅鑼鄉": [
  "苗栗縣"
 ],
 "鳳山區": [
  "高雄市"
 ],
 "鳳林鎮": [
  "花蓮縣"
 ],
 "潭子區": [
  "臺中市"
 ],
 "潮州鎮": [
  "屏東縣"
 ],
 "線西鄉": [
  "彰化縣"
 ],
 "褒忠鄉": [
  "雲林縣"
 ],
 "學甲區": [
  "臺南市"
 ],
 "樹林區": [
  "新北市"
 ],
 "橋頭區": [
  "高雄市"
 ],
 "橫山鄉": [
  "新竹縣"
 ],
 "燕巢區": [
  "高雄市"
 ],
 "頭份市": [
  "苗栗縣"
 ],
 "頭城鎮": [
  "宜蘭縣"
 ],
 "頭屋鄉": [
  "苗栗縣"
 ],
 "龍井區": [
  "臺中市"
 ],
 "龍崎區": [
  "臺南市"
 ],
 "龍潭區": [
  "桃園市"
 ],
 "龜山區": [
  "桃園市"
 ],
 "彌陀區": [
  "高雄市"
 ],
 "礁溪鄉": [
  "宜蘭縣"
 ],
 "歸仁區": [
  "臺南市"
 ],
 "豐原區": [
  "臺中市"
 ],
 "豐濱鄉": [
  "花蓮縣"
 ],
 "雙溪區": [
  "新北市"
 ],
 "羅東鎮": [
  "宜蘭縣"
 ],
 "關山鎮": [
  "臺東縣"
 ],
 "關西鎮": [
  "新竹縣"
 ],
 "關廟區": [
  "臺南市"
 ],
 "霧峰區": [
  "臺中市"
 ],
 "霧臺鄉": [
  "屏東縣"
 ],
 "寶山鄉": [
  "新竹縣"
 ],
 "蘆竹區": [
  "桃園市"
 ],
 "蘆洲區": [
  "新北市"
 ],
 "蘇澳鎮": [
  "宜蘭縣"
 ],
 "蘭嶼鄉": [
  "臺東縣"
 ],
 "鶯歌區": [
  "新北市"
 ],
 "麟洛鄉": [
  "屏東縣"
 ],
 "鹽水區": [
  "臺南市"
 ],
 "鹽埔鄉": [
  "屏東縣"
 ],
 "鹽埕區": [
  "高雄市"
 ],
 "觀音區": [
  "桃園市"
 ]
};
